app/Http/Controllers/BranchController.php

	public function getBranch()
	{
		return Branch::where('country_id', Auth::user()->country_id)->get();
---
select * from `branches` where `country_id` = 1 and `branches`.`deleted_at` is null

	public function getBranchEger()
	{
		return Branch::setEagerLoads([])->orderBy('branch_name')->where('country_id', Auth::user()->country_id)->get();
---
select * from `branches` where `country_id` = 1 and `branches`.`deleted_at` is null order by `branch_name` asc