app/Http/Controllers/CountryController.php

select * from `branches` where `branches`.`country_id` in (1, 2, 3, 4) and `branches`.`deleted_at` is null
select * from `countries` where `countries`.`deleted_at` is null
---
    public function getCountry()
    {
        return Country::with(['branches'])->get();