app/Http/Controllers/DashboardController.php

select count(id) as count, date_format(created_at, "%M") as date from `shipments` where `country_id` = 1 group by `date` order by `id` asc
---
    public function getChartData(Request $request)
    {
        // return Shipment::take(100)->get();
        if (empty($request->id)) {
            $shipments = DB::table('shipments')
                ->select(DB::raw('count(id) as count, date_format(created_at, "%M") as date'))
                ->orderBy('id', 'asc')
                ->groupBy('date')
                ->get();
        } else {
            $shipments = Shipment::withoutGlobalScopes()
                ->select(DB::raw('count(id) as count, date_format(created_at, "%M") as date'))
                ->orderBy('id', 'asc')
                ->groupBy('date')
                ->where('country_id', $request->id)
                ->get();

select count(id) as count, date_format(created_at, "%M") as date from `shipments` where `country_id` = 1 and `status` = 'Scheduled' group by `date` order by `id` asc
---
    public function getChartScheduled(Request $request)
    {
        // return $request->all();
        if (empty($request->id)) {
                $shipments = DB::table('shipments')
                ->select(DB::raw('count(id) as count, date_format(created_at, "%M") as date'))
                ->orderBy('id', 'asc')
                ->groupBy('date')
                ->where('status', 'Scheduled')
                ->get();
        } else {
            $shipments = Shipment::withoutGlobalScopes()
                ->select(DB::raw('count(id) as count, date_format(created_at, "%M") as date'))
                ->orderBy('id', 'asc')
                ->groupBy('date')
                ->where('country_id', $request->id)
                ->where('status', 'Scheduled')
                ->get();

select count(id) as count, date_format(created_at, "%M") as date from `shipments` where `country_id` = 1 and `status` = 'Delivered' group by `date` order by `id` asc
---
    public function getChartDelivered(Request $request)
    {
        // return Shipment::take(100)->get();
        if (empty($request->id)) {
            $shipments = DB::table('shipments')
                ->select(DB::raw('count(id) as count, date_format(created_at, "%M") as date'))
                ->orderBy('id', 'asc')
                ->groupBy('date')
                ->where('status', 'Delivered')
                ->get();
        } else {
            $shipments = Shipment::withoutGlobalScopes()
                ->select(DB::raw('count(id) as count, date_format(created_at, "%M") as date'))
                ->orderBy('id', 'asc')
                ->groupBy('date')
                ->where('country_id', $request->id)
                ->where('status', 'Delivered')
                ->get();

select count(id) as count, date_format(created_at, "%M") as date from `shipments` where `country_id` = 1 and `status` = 'Cancelled' group by `date` order by `id` asc
---
    public function getChartCancled(Request $request)
    {
        // return Shipment::take(100)->get();
        if (empty($request->id)) {
            $shipments = Shipment::select(DB::raw('count(id) as count, date_format(created_at, "%M") as date'))
                ->orderBy('id', 'asc')
                ->groupBy('date')
                ->where('status', 'Cancelled')
                ->get();
        } else {
            $shipments = Shipment::withoutGlobalScopes()
                ->select(DB::raw('count(id) as count, date_format(created_at, "%M") as date'))
                ->orderBy('id', 'asc')
                ->groupBy('date')
                ->where('country_id', $request->id)
                ->where('status', 'Cancelled')
                ->get();

select * from `branches` where `country_id` = 1 and `branches`.`deleted_at` is null
select count(*) as aggregate from `shipments` where `branch_id` = 1 and `country_id` = 1 and `shipments`.`deleted_at` is null
---
    public function getBranchCount(Request $request)
    {
        if (empty($request->id)) {
            $branches = Branch::setEagerLoads([])->where('country_id', Auth::user()->country_id)->get();
        } else {
            $branches = Branch::setEagerLoads([])->where('country_id', $request->id)->get();
        }
        $branch_count = [];
        if (empty($request->id)) {
            foreach ($branches as $key => $branch) {
                // return $branch->id;
                // $branch_count[] = Shipment::where('branch_id', $branch->id)->count();
                $branch_count[] = array(
                    'name' => $branch->branch_name,
                    'id' => $key,
                    'count' => Shipment::where('branch_id', $branch->id)->count(),
                );
            }
        } else {
            foreach ($branches as $key => $branch) {
                $branch_count[] = array(
                    'name' => $branch->branch_name,
                    'id' => $key,
                    'count' => Shipment::withoutGlobalScopes()->where('branch_id', $branch->id)->where('country_id', $request->id)->count(),
                );

select count(id) as count, date_format(created_at, "%M") as date from `shipments` where `country_id` = 1 group by `date` order by `id` asc
---
    public function getChartBranch(Request $request)
    {
        // return Shipment::take(100)->get();
        if (empty($request->id)) {
            $shipments = DB::table('shipments')
                ->select(DB::raw('count(id) as count, date_format(created_at, "%M") as date'))
                ->orderBy('id', 'asc')
                ->groupBy('date')
                // ->where('branch_id', Auth::id())
                ->get();
        } else {
            $shipments = Shipment::withoutGlobalScopes()
                ->select(DB::raw('count(id) as count, date_format(created_at, "%M") as date'))
                ->orderBy('id', 'asc')
                ->groupBy('date')
                ->where('country_id', $request->id)

select * from `countries` where `countries`.`deleted_at` is null
select count(*) as aggregate from `shipments` where `country_id` = 1 and `shipments`.`deleted_at` is null
---
    public function getCountryhipments(Request $request)
    {
        $countries = Country::setEagerLoads([])->get();
        $country_count = [];
        foreach ($countries as $key => $country) {
            // return $country->id;
            // $country_count[] = Shipment::where('country_id', $country->id)->count();
            $country_count[] = array(
                'name' => $country->country_name,
                'id' => $key,
                'count' => Shipment::withoutGlobalScopes()->where('country_id', $country->id)->count(),
            );

select count(id) as count, date_format(created_at, "%M") as date from `shipments` where `country_id` = 1 group by `date` order by `id` asc
---
    public function getChartCountry(Request $request)
    {
        // return Shipment::take(100)->get();
        if (empty($request->id)) {
            $shipments = DB::table('shipments')
                ->select(DB::raw('count(id) as count, date_format(created_at, "%M") as date'))
                ->orderBy('id', 'asc')
                ->groupBy('date')
                // ->where('country_id', )
                ->get();
        } else {

            $shipments = Shipment::withoutGlobalScopes()
                ->select(DB::raw('count(id) as count, date_format(created_at, "%M") as date'))
                ->orderBy('id', 'asc')
                ->groupBy('date')
                ->where('country_id', $request->id)

select count(*) as aggregate from `shipments` where `country_id` = 1 and `status` = 'Delivered' and `shipments`.`deleted_at` is null
---
    public function countPending(Request $request)
    {
        // return Shipment::count();
        if (empty($request->id)) {
            return Shipment::where('status', '!=', 'Delivered')->where('status', '!=', 'Cancelled')->count();
        } else {
            return Shipment::withoutGlobalScopes()->where('country_id', $request->id)->where('status', '!=', 'Delivered')->where('status', '!=', 'Cancelled')->count();

select count(*) as aggregate from `shipments` where `country_id` = 1 and `shipments`.`deleted_at` is null
---
    public function countCountShipments(Request $request)
    {
        // return Shipment::count();
        if (empty($request->id)) {
            return Shipment::count();
        } else {
            return Shipment::withoutGlobalScopes()->where('country_id', $request->id)->count();