app/Http/Controllers/FilterController.php

    public function filterShipment(Request $request)
    {
        // return $request->all();
        // dd($start = $request->no_btw['start'] - 1);
        $start = $request->no_btw['start'] - 1;
        if (Auth::user()->hasRole('Admin') || Auth::user()->hasPermissionTo('filter by country')) {
            if ($request->selectCountry['id'] == 'all') {
                if ($request->form['start_date'] == '' || $request->form['end_date'] == '') {
                    if ($request->select['id'] == 'all') {
                        if ($request->selectStatus['name'] == 'All') {
                            // return 'st6';
                            $shipment_filter = Shipment::latest()->where('country_id', Auth::user()->country_id)->skip($start)->take(500)->get();
---
select * from `shipments` where `country_id` = 1 and `shipments`.`deleted_at` is null order by `created_at` desc limit 500 offset 0