app/Http/Controllers/HomeController.php

    public function courier()
    {
        $user = Auth::user();
        if (!$user->passwordSecurity) {
            $passwordSecurity = PasswordSecurity::create([
                'user_id' => $user->id,
                'password_expiry_days' => 1,
                'password_updated_at' => Carbon::now(),
            ]);
        }
        $permissions = [];
        foreach (Permission::all() as $permission) {
---
select * from `permissions`