app/Http/Controllers/LocationController.php

select `lat`, `lat_to`, `lng`, `lng_to` from `shipments` where `shipments`.`id` = '169' and `shipments`.`deleted_at` is null limit 1
---
	public function getcoordinatesArray($id) {
         $coodinates = Shipment::select('lat', 'lat_to', 'lng', 'lng_to')->find($id);