app/Http/Controllers/NotificationController.php

select * from `notifications` where `notifications`.`notifiable_id` = 1 and `notifications`.`notifiable_id` is not null and `notifications`.`notifiable_type` = 'App\User' and `read_at` is null order by `created_at` desc
---
    public function Chattynoty()
    {
        // $user = Auth::user();
        // return $user->notifications;
        $notification_data = [];
        // select * from `notifications` where `notifications`.`notifiable_id` = '1' and `notifications`.`notifiable_id` is not null and `notifications`.`notifiable_type` = 'App\User' and `read_at` is null order by `created_at` desc
        $unreadNotifications = DB::table('notifications')
            ->where('notifiable_id', Auth::id())
            ->whereNotNull('notifiable_id')
            ->where('type', 'App\Notifications\ChattyNoty')
            ->where('notifiable_type', 'App\User')
            ->whereNull('read_at')
            ->get();