app/Http/Controllers/PermissionController.php

    public function getUsersCount(Request $request)
    {
        if (empty($request->country)) {
            return User::where('country_id', Auth::user()->country_id)->whereYear('created_at', '=', date("Y"))->count();
---
select count(*) as aggregate from `users` where `country_id` = 1 and `users`.`deleted_at` is null

    public function getShipmentsCount(Request $request)
    {

        if (Auth::guard('clients')->check()) {
            return;
        }
        if (empty($request->country)) {
            return Shipment::where('country_id', Auth::user()->country_id)->whereYear('created_at', '=', date("Y"))->count();
---
select count(*) as aggregate from `shipments` where `country_id` = 1 and `shipments`.`deleted_at` is null

    public function getCanceledCount(Request $request)
    {
        if (empty($request->country)) {
            return Shipment::where('country_id', Auth::user()->country_id)->whereYear('created_at', '=', date("Y"))->where('status', 'Cancelled')->count();
---
select count(*) as aggregate from `shipments` where `country_id` = 1 and `status` = 'Cancelled' and `shipments`.`deleted_at` is null

    public function delayedShipmentCount(Request $request)
    {
        if (empty($request->country)) {
            return Shipment::where('status', 'Delayed')->count();
---
select count(*) as aggregate from `shipments` where `status` = 'Delayed' and `shipments`.`deleted_at` is null

    public function scheduledShipmentCount(Request $request)
    {
        if (empty($request->country)) {
            return Shipment::where('country_id', Auth::user()->country_id)->whereYear('created_at', '=', date("Y"))->where('status', 'Scheduled')->count();
        } else {
            return Shipment::where('country_id', $request->country)->whereYear('created_at', '=', $request->year_f)->where('status', 'Scheduled')->count();
---
select count(*) as aggregate from `shipments` where `country_id` = 1 and `status` = 'Scheduled' and `shipments`.`deleted_at` is null
select count(*) as aggregate from `shipments` where `country_id` = 1 and `status` = 'Derivered' and `shipments`.`deleted_at` is null