app/Http/Controllers/RoleController.php

select * from `permissions`
---
	public function getPermissions()
	{
		return Permission::all();

select * from `roles`
---
	public function getRoles()
	{
		return Role::all();

select `permissions`.*, `role_has_permissions`.`role_id` as `pivot_role_id`, `role_has_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` = 3
---
	public function getRolesPerm(Request $request)
	{
		// return $request->all();
		return Role::findByName($request->name)->permissions->pluck('name');