app/Http/Controllers/ScanController.php

    public function barcodeUpdate(Request $request, Shipment $shipment, $bar_code = null)
    {
        // return $request->all();
        $bar_code = str_replace("-", "", $request->bar_code_out);
        $barcode = Shipment::where('bar_code', 'LIKE', "%{$bar_code}%")->first();
---
select * from `shipments` where `bar_code` LIKE '%81124527%' and `shipments`.`deleted_at` is null limit 1