app/Http/Controllers/ShipmentController.php

select `id` from `shipments` where `status` != 'Delivered' and `status` != 'Warehouse' and `status` != 'Cancelled' and date(`derivery_date`) <= '2019-08-13' and date(`created_at`) <= '2019-07-13' and `shipments`.`deleted_at` is null order by `created_at` asc
---
    public function updateCancelled()
    {
        // getting the dispatcher instance (needed to enable again the event observer later on)
        $dispatcher = Shipment::getEventDispatcher();
        // disabling the events
        Shipment::unsetEventDispatcher();
        $today = Carbon::today();
        // $tomorrow = Carbon::tomorrow();
        $yest = Carbon::now()->subDays(1);
        $prev_month = $today->subMonth();
        $refused = Shipment::select('id', 'bar_code')->setEagerLoads([])
            ->where(function ($query) {
                $query->where('status', 'Returned');
                $query->orWhere('status', 'Scheduled');
                $query->orWhere('status', 'Dispatched');
            })
            ->orderBy('created_at')
            ->whereDate('derivery_date', '<=', $yest)
            ->whereDate('created_at', '<=', $prev_month)
            ->get('id')->toArray();
        $cancell_status = ['Returned', 'Scheduled', 'Dispatched', 'Delivered', 'Warehouse', 'Cancelled', 'Refused'];
        $cancelled = Shipment::select('id')->setEagerLoads([])
            ->whereNotIn('status', $cancell_status)
            ->orWhere('status', null)
            ->orderBy('created_at')
            ->whereDate('created_at', '<=', $prev_month)
            ->get('id')->toArray();

update `shipments` set `status` = 'Cancelled', `shipments`.`updated_at` = '2019-08-13 14:53:49' where 0 = 1 and `shipments`.`deleted_at` is null
---
        $bar_code = Shipment::select('bar_code')->setEagerLoads([])->whereIn('id', $id_can)->get()->toArray();
        $bar_code_ = array_flatten($bar_code);
        Shipment::whereIn('id', $id_ref)->update(['status' => 'Refused']);
        Shipment::whereIn('id', $id_can)->update(['status' => 'Cancelled']);

update `shipments` set `status` = 'Dispatched', `derivery_status` = 'Dispatched', `dispatch_date` = '2019-08-09 15:29:02', `shipments`.`updated_at` = '2019-08-09 15:29:02' where `id` = 34
---
        } elseif ($request->formobg['status'] == 'Dispatched') {
            $shipment->dispatch_date = now();
        }
        if ($shipment->save()) {