app/Http/Controllers/StatusController.php

select `name` from `statuses` where `statuses`.`deleted_at` is null order by `name` asc
---
    public function getStatuses()
    {
        // return Status::select('name')->orderBy('name', 'ASC')->get();
        $user = Auth::user();
        if ($user->hasAllPermissions(['update delivered', 'update dispatched', 'update returned'])) {
            return Status::select('name')->orderBy('name', 'ASC')->get();