app/Http/Controllers/TownController.php

	public function getTownCharge() {
		return Town::with('charges')->get();
---
select * from `charges` where `charges`.`town_id` in (1, 2, 3)
select * from `towns`