app/Http/Controllers/UserController.php

    public function getUsers(Request $request)
    {
        // return $request->all();
        // return User::with(['roles'])->get();
        $users = User::orderBy('name')->get();
---
select * from `users` where `users`.`deleted_at` is null order by `name` asc

    public function getUserPerm(Request $request, $id)
    {
        $user = User::find($id);
---
select * from `users` where `users`.`deleted_at` is null

    public function undeletedUser($id)
    {
        return User::where('id', $id)->restore();
---
update `users` set `password` = 'y$bJPdMxiQl1UrH4EBSzA/zeY7W7OU29.n6Icqj7GYp8gOvwYdvQyc.', `users`.`updated_at` = '2019-08-13 14:53:10' where `id` = 1